## Step 3: Import your analysis libraries, as well as your new customer data set as a dataframe

In [3]:
#Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [4]:
path = r'C:\Users\ACER NITRO\Documents\Achievement 4'

In [5]:
df_customer = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers.csv'), index_col = False)

In [21]:
df_ords_prods_merge =  pd.read_pickle(os.path.join(path,'Data', 'Prepared Data', 'orders_products_aggregated.pkl'))

## Step 4: Wrangle the data so that it follows consistent logic.

## Data Wrangling

In [7]:
df_customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Renaming column names

column name 'First Name' needs to be renamed as 'first_name'
column name 'Surnam needs' to be renamed as 'surname'
column name 'Gender' needs to be renamed to 'gender'
column name 'STATE' needs to be renamed 'state'
column name 'Age' needs to be renamed as age

In [9]:
df_customer.rename(columns = {'First Name' : 'first_name'},
                inplace = True
               )
df_customer.rename(columns = {'Surnam' : 'surname'},
                inplace = True
               )
df_customer.rename(columns = {'Gender' : 'gender'},
                inplace = True
               )
df_customer.rename(columns = {'Age' : 'age'},
                inplace = True
               )
df_customer.rename(columns = {'STATE' : 'state'},
                inplace = True
               )

In [10]:
df_customer.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Step5: Complete the fundamental data quality and consistency checks

### Checking Mixed type data

In [11]:
for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

first_name

Column 'first name' has mixed data type values

#check if there is missing value in 'customer' column 

customer.isnull().sum()

In [14]:
#check if there is missing value in 'first name' column 

df_customer['first_name'].isnull().sum()

11259

In [16]:
# impute NaN value with 'unknown'

df_customer['first_name'].fillna('Unknown', inplace=True)

In [18]:
#check if there's still mixed value types
for col in df_customer.columns.tolist():
  weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[weird]) > 0:
    print (col)

###  Check Missing values

In [19]:
df_customer.isnull().sum()

user_id         0
first_name      0
surname         0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

There are no missing values 'df_customer' data frame

### check duplicates

In [20]:
df_customer[df_customer.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

There are no duplicates.

## Step 6: Combine your customer data with the rest of your prepared Instacart data

In [24]:
df_ords_prods_customer_merge = df_ords_prods_merge .merge(df_customer, on = ['user_id'])

In [27]:
df_ords_prods_customer_merge.shape

(32404859, 33)

## Step8: Export this new dataframe

In [28]:
#Export to pickle file
df_ords_prods_customer_merge.to_pickle(os.path.join(path, 'Data','Prepared Data', 'ords_prods_customer_merge_.pkl'))